/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Rozszerzenie Telesec";
"06 06 02 82 06 01 0A 01"		= "Mechanizm Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Uwierzytelnianie Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Uwierzytelnianie hasłem";
"06 08 02 82 06 01 0A 01 00 02" = "Uwierzytelnianie hasłem zabezpieczonym";
"06 08 02 82 06 01 0A 01 00 03" = "Uwierzytelnianie jednokierunkowe X.509";
"06 08 02 82 06 01 0A 01 00 04" = "Uwierzytelnianie dwukierunkowe X.509";
"06 08 02 82 06 01 0A 01 00 05" = "Uwierzytelnianie trzykierunkowe X.509";
"06 08 02 82 06 01 0A 01 00 06" = "Uwierzytelnianie jednokierunkowe ISO9798";
"06 08 02 82 06 01 0A 01 00 07" = "Uwierzytelnianie dwukierunkowe ISO9798";
"06 08 02 82 06 01 0A 01 00 08" = "Uwierzytelnianie Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Podpis Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 z RSA oraz ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 z RSA oraz standardem podpisu Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 z RSA oraz ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 z RSA oraz standardem podpisu Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 z RSA oraz standardem podpisu Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "Podpis HBCI RSA";

"06 07 02 82 06 01 0A 01 02"	= "Szyfrowanie Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "brak";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Purpurowy";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Funkcja jednokierunkowa";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Mieszanie przy użyciu szyfru blokowego";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Funkcja FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Moduł Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Algorytmy";
"06 07 02 82 06 01 0A 02 01"	= "Typy atrybutów";
"06 07 02 82 06 01 0A 02 02"	= "Typy certyfikatów";
"06 07 02 82 06 01 0A 02 03"	= "Typy komunikatów";
"06 07 02 82 06 01 0A 02 04"	= "Protokół PL";
"06 07 02 82 06 01 0A 02 05"	= "SME oraz składniki SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Przydatne definicje";
"06 07 02 82 06 01 0A 02 08"	= "Pliki STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Zamówienie elektroniczne";
"06 07 02 82 06 01 0A 02 0B"	= "Asymetryczny program Telesec TTP";
"06 07 02 82 06 01 0A 02 0C"	= "Podstawowy program Telesec TTP";
"06 07 02 82 06 01 0A 02 0D"	= "Komunikaty Telesec TTP";
"06 07 02 82 06 01 0A 02 0E"	= "Program znakowania czasem Telesec TTP";

"06 06 02 82 06 01 0A 03"		= "Klasa obiektu";
"06 07 02 82 06 01 0A 03 00"	= "Inna nazwa Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Katalog";
"06 07 02 82 06 01 0A 03 02"	= "Typ katalogu";
"06 07 02 82 06 01 0A 03 03"	= "Grupa katalogu";
"06 07 02 82 06 01 0A 03 04"	= "Użytkownik katalogu";
"06 07 02 82 06 01 0A 03 05"	= "Wpis klucza symetrycznego";

"06 06 02 82 06 01 0A 04"		= "Pakiet";
"06 06 02 82 06 01 0A 05"		= "Parametr";
"06 06 02 82 06 01 0A 06"		= "Powiązanie nazwy";
"06 06 02 82 06 01 0A 07"		= "Atrybut";
"06 07 02 82 06 01 0A 07 00"	= "ID grupy programu";
"06 07 02 82 06 01 0A 07 01"	= "Typ certyfikatu";
"06 07 02 82 06 01 0A 07 02"	= "Certyfikat Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Numer certyfikatu";
"06 07 02 82 06 01 0A 07 04"	= "Lista unieważnień certyfikatów";
"06 07 02 82 06 01 0A 07 05"	= "Data utworzenia";
"06 07 02 82 06 01 0A 07 06"	= "Wystawca";
"06 07 02 82 06 01 0A 07 07"	= "Urząd nazewnictwa";
"06 07 02 82 06 01 0A 07 08"	= "Katalog kluczy publicznych";
"06 07 02 82 06 01 0A 07 09"	= "Domena zabezpieczeń";
"06 07 02 82 06 01 0A 07 0A"	= "Podmiot";
"06 07 02 82 06 01 0A 07 0B"	= "Czas unieważnienia";
"06 07 02 82 06 01 0A 07 0C"	= "Odniesienie grupy użytkowników";
"06 07 02 82 06 01 0A 07 0D"	= "Ważność";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Środowisko komunikatu bezpieczeństwa";
"06 07 02 82 06 01 0A 07 10"	= "Katalog anonimowych kluczy publicznych";
"06 07 02 82 06 01 0A 07 11"	= "Nazwa Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Dodatkowe nazwy";
"06 07 02 82 06 01 0A 07 13"	= "Kod pocztowy Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Wyróżnienie nazwy";
"06 07 02 82 06 01 0A 07 15"	= "Lista certyfikatu Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Lista certyfikatu Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "Lista certyfikatu X.509";
"06 07 02 82 06 01 0A 07 18"	= "Czas wystawienia";
"06 07 02 82 06 01 0A 07 19"	= "Numer karty fizycznej";
"06 07 02 82 06 01 0A 07 1A"	= "Typ pliku";
"06 07 02 82 06 01 0A 07 1B"	= "Plik Ctl jest archiwum";
"06 07 02 82 06 01 0A 07 1C"	= "Adres email";
"06 07 02 82 06 01 0A 07 1D"	= "Lista szablonów certyfikatów";
"06 07 02 82 06 01 0A 07 1E"	= "Nazwa katalogu";
"06 07 02 82 06 01 0A 07 1F"	= "Nazwa typu katalogu";
"06 07 02 82 06 01 0A 07 20"	= "Nazwa grupy katalogu";
"06 07 02 82 06 01 0A 07 21"	= "Nazwa użytkownika katalogu";
"06 07 02 82 06 01 0A 07 22"	= "Sygnalizator unieważnienia";
"06 07 02 82 06 01 0A 07 23"	= "Nazwa wpisu klucza symetrycznego";
"06 07 02 82 06 01 0A 07 24"	= "Liczba GL";
"06 07 02 82 06 01 0A 07 25"	= "Liczba GO";
"06 07 02 82 06 01 0A 07 26"	= "Dane klucza G";
"06 07 02 82 06 01 0A 07 27"	= "Dane klucza Z";
"06 07 02 82 06 01 0A 07 28"	= "Dane klucza KT";
"06 07 02 82 06 01 0A 07 2A"	= "Liczba klucza KT";
"06 07 02 82 06 01 0A 07 33"	= "Czas wygenerowania unieważnienia";
"06 07 02 82 06 01 0A 07 34"	= "Test odpowiedzialności";

"06 06 02 82 06 01 0A 08"		= "Grupa atrybutu";
"06 06 02 82 06 01 0A 09"		= "Czynność";
"06 06 02 82 06 01 0A 0A"		= "Powiadomienie";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Program ochrony";

"06 06 02 82 06 01 0A 0C"		= "Definicje certyfikatu i rozszerzeń CRL";

"06 07 02 82 06 01 0A 0C 00"	= "Rozszerzenie ograniczenia odpowiedzialności rozszerzenia certyfikatu";
"06 07 02 82 06 01 0A 0C 01"	= "Rozszerzenie ID certyfikatu Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "ID zasad Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "ID kwalifikatora zasad Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Rozszerzenie filtrowania CRL Telesec";
"06 07 02 82 06 01 0A 0C 05"	= "Rozszerzenie filtra CRL Telesec";
"06 07 02 82 06 01 0A 0C 06"	= "Rozszerzenie urzędu nazewnictwa Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID użytkownika";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Skrzynka pocztowa RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Składnik domeny";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Australijski wykaz firm";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "ID zasad certyfikatów - Australia";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet prywatny";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet służbowy";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet prawny";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "ID zasad Signet";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Algorytm szyfrowania symetrycznego";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "ID zasad SEIS High-Assurance";
"06 06 2A 85 70 22 01 02"	= "ID zasad SEIS GAK";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Prywatny ID SEIS AT";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Moduł ANSI X9.57";
"06 07 2A 86 48 CE 38 01 01"	= "Zarządzanie certyfikatami X9F1";
"06 06 2A 86 48 CE 38 02"		= "Instrukcja wstrzymania";
"06 07 2A 86 48 CE 38 02 01"	= "Instrukcja wstrzymania-Brak";
"06 07 2A 86 48 CE 38 02 02"	= "Wywołanie wystawcy";
"06 07 2A 86 48 CE 38 02 03"	= "Odrzuć";
"06 07 2A 86 48 CE 38 02 04"	= "Token pobrania";
"06 06 2A 86 48 CE 38 03"		= "Atrybut";
"06 06 2A 86 48 CE 38 03 01"	= "Kontrpodpis";
"06 06 2A 86 48 CE 38 03 02"	= "Certyfikat atrybutu";
"06 06 2A 86 48 CE 38 04"		= "Algorytm";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "Dopasowanie DSA";
"06 07 2A 86 48 CE 38 04 03"	= "DSA z SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Typ pola ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "Pole podstawowe";
"06 07 2A 86 48 CE 3D 01 02"	= "Pole Characteristic-Two";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Podstawa Characteristic-Two";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Podstawa null";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Podstawa trójmianowa";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Podstawa pięciomianowa";
"06 06 2A 86 48 CE 3D 02"		= "Typ klucza publicznego";
"06 07 2A 86 48 CE 3D 02 01"	= "Klucz publiczny krzywej eliptycznej";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Typ pola ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "Ciało pierwsze Galoisa";
"06 06 2A 86 48 CE 3E 02"		= "Typ numeru";
"06 07 2A 86 48 CE 3E 02 01"	= "Klucz publiczny Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "Schemat";
"06 07 2A 86 48 CE 3E 03 01"	= "Statyczny Diffie-Hellman";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman (tymczasowy)";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman (hybrydowy 1)";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman (hybrydowy 2)";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Informacje o wersji Entrust";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE z MD5 oraz CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC z hasłem";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Użytkownik Entrust";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Informacje o CA Entrust";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Certyfikat atrybutu";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Szyfrowanie RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2, szyfr. RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4, szyfr. RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5, szyfr. RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1, szyfr. RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "Szyfrowanie RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "Szyfrowanie RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "Określona etykieta RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Schemat podpisu RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256, szyfr. RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384, szyfr. RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512, szyfr. RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224, szyfr. RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Szyfrowanie BSAFE RSA";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Uzgadnianie klucza Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE z MD2 oraz DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE z MD5 oraz DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE z MD2 oraz RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE z MD5 oraz RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE z MD5 oraz XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE z SHA oraz DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Dane";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Podpisane dane";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Dane zapakowane";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Dane podpisane i zapakowane";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Dane skrócone";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Dane zaszyfrowane";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Dane z atrybutami";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Dane o szyfrowaniu klucza prywatnego";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Adres email";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Nazwa bez struktury";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Typ zawartości";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Streszczenie komunikatu";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Czas podpisania";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Kontrpodpis";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Hasło wezwania";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Adres bez struktury";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Atrybuty certyfikatu rozszerzonego";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Wystawca i numer seryjny";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Sprawdzanie hasła";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Klucz publiczny";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Opis podpisu";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Zlecenie rozszerzenia";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Możliwości S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Preferuj dane podpisane";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Nie można odszyfrować";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Żądanie odbioru";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Odbiór";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Wskazówka do zawartości";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Historia rozszerzenia listy pocztowej";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Moduły S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Składnia wiadomości kryptograficznej";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Rozszerzone usługi ochrony";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "ID obiektu S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Wiadomość S/MIME V3";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Podpis elektroniczny ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Podpis elektroniczny ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Zasady podpisywania elektronicznego ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Zasady podpisywania elektronicznego ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Typy zawartości S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Uwierzytelnione atrybuty S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Algorytmy S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Dystrybucja certyfikatu S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Dystrybucja certyfikatu LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Kwalif. zasad podpisu S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Typ ID podpisu S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Podpis inicjatora";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Podpis domeny";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Podpis atrybutów dodatkowych";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Przegląd podpisu";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Możliwości S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Preferuj binarne wewnątrz";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Przyjazna nazwa (dla PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "ID klucza lokalnego (dla PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Typy certyfikatów (dla PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Certyfikat X.509 (dla PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Certyfikat SDSI (dla PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Typy CRL (dla PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "CRL X.509 (dla PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "Składnia wymiany danych osobistych PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "ID szyfrowania hasłem PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE z SHA-1 oraz 128-bitowym RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE z SHA-1 oraz 40-bitowym RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE z SHA-1 oraz potrójnym DES-CBC (3 klucze)";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE z SHA-1 oraz potrójnym DES-CBC (2 klucze)";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE z SHA-1 oraz 128-bitowym RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE z SHA-1 oraz 40-bitowym RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "ID ESPVK PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Maskowanie klucza PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "ID zbioru PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "ID zbioru klucza PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "ID zbioru certyfikatu i CRL PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "ID zbioru hasła PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "ID bezpiecznej zawartości PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "ID zbioru maskowanego klucza PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "Id zbioru certyfikatu PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "ID zbioru certyfikatu i CRL PKCS-12 X.509";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "ID zbioru certyfikatu SDSI PKCS-12";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "OID PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "ID szyfrowania hasłem PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE z SHA-1 oraz 128-bitowym RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE z SHA-1 oraz 40-bitowym RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE z SHA-1 oraz potrójnym DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE z SHA-1 oraz 128-bitowym RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE z SHA-1 oraz 40-bitowym RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE z SHA-1 oraz RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE z SHA-1 oraz RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "ID pakowania PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "Szyfrowanie PKCS-12 RSA z 128-bitowym RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "Szyfrowanie PKCS-12 RSA z 40-bitowym RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "Szyfrowanie PKCS-12 RSA z potrójnym DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "ID podpisu PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Podpis PKCS-12 RSA ze streszczeniem SHA-1";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 wersja 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "ID zbioru PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "Zbiór klucza PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Zbiór maskowanego klucza PKCS-12 PKCS-8";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Zbiór certyfikatu PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "Zbiór CRL PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Zbiór hasła PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Zbiór bezpiecznej zawartości PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Moduły PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Atrybuty PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Typ zawartości PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Zawartości PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Algorytm streszczenia RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC z SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "algorytm szyfrowania RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 z MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "Dopełnienie RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "ID nieznanych zasad Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "Kerberos MIT User-to-User";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Klasa obiektu Microsoft Exchange Server";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Adresowanie witryn";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Schemat klasy";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Schemat atrybutu";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Agent skrzynki pocztowej";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Skrzynka pocztowa";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Kontener";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Odbiorca poczty";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Mechanizm dostarczania";

"06 07 2A 86 48 86 F7 14 04"				= "Formaty plików Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Kod uwierzytelniający";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Pośredni kontekst danych SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Informacje o agencji SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Typ instrukcji SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Informacje o dziele SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Rozszerzenia certyfikatu SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Dane obrazu SPC PE";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "Łącze SPC (typ 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Indywidualne podpisywanie kodu";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Komercyjne podpisywanie kodu";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "Łącze SPC (typ 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Minimalne kryteria SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Kryteria finansowe SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "Łącze SPC (typ 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Dostawca wsparcia ochrony NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Kontrpodpis znacznikiem czasu";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Lista zaufania certyfikatu";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Posortowane rozszerzenie CTL";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Lokacja następnego uaktualnienia";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Rozszerzone użycie klucza";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Podpisywanie listy zaufania certyfikatu";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Podpisywanie znacznikiem czasem";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Szyfrowanie SGC";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Szyfrowanie seryjne";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Zaszyfrowane systemy plików";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Odzyskiwanie zaszyfrowanych systemów plików";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Zgodne ze sprzętem Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Podpisywanie NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Podpisywanie OEM sprzętu Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Osadzone podpisywanie NT";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Podpisywanie listy zaufanych certyfikatów głównych";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Subordynacja kwalifikowana";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Odzyskiwanie klucza";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Podpisanie dokumentu";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "ID obiektu atrybutu";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Atrybut zaufania Tak/Nie";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM Individualization";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Licencje Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Serwer licencji Microsoft";

"06 08 2B 06 01 04 01 82 37 0D"				= "ID obiektu Microsoft PKCS-10";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Odnowienie certyfikatu";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Para nazwa/wartość rejestracji";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "CSP rejestracji";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Wersja OS";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Atrybuty Microsoft PKCS-12";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Zestaw kluczy komputera lokalnego";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft Enrollment Infrastructure";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Użycie autorejestracji CTL";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Typ certyfikatu rejestracji";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Agent rejestracji";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Logowanie ze Smartcard";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Nazwa główna NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoft Certificate Server Infrastructure";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Wersja odnowienia Microsoft CA";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Wersja CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Atrybut CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Nazwa dokumentu";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Opis dokumentu";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Dane zaszyfrowane";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Zawartość zaszyfrowana";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "ID zasad UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ID zasad ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ID zasad CA ICE-TEL";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal z SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal z RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Atrybuty cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Sprawdzanie obecności cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "RTCS odpowiedzi OCSP";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "Rozszerzone RTCS odpowiedzi OCSP";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Rozszerzona przyczyna CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Główne funkcje";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "Boot PKI";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Zawartość cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Dane konfiguracji cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Indeks użytkownika cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Dane użytkownika cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "ID zasad XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Trwały";
"06 08 2B 06 01 04 01 AA 60 01"		= "System znakowania czasem";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "System znakowania czasem 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "System znakowania czasem 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "System znakowania czasem 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Procesy dodatkowe";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "ID lekarzy";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Dane uwierzytelnienia Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Dane klucza Kerberos Diffie-Hellman";
"06 07 2B 06 01 05 02 03 03"        = "Dane klucza odpowiedzi Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Uwierzytelnienie klienta Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Centrum dystrybucji kluczy Kerberos (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Simple Public Key Mechanism (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Infrastruktura klucza publicznego";

"06 07 2B 06 01 05 05 07 01"		= "Rozszerzenia certyfikatu prywatnego PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Dostęp do informacji urzędu certyfikacji";
"06 08 2B 06 01 05 05 07 01 02"		= "Informacje biometryczne";
"06 08 2B 06 01 05 05 07 01 03"		= "Oświadczenia certyfikatu kwalifikowanego";
"06 08 2B 06 01 05 05 07 01 04"		= "Tożsamość kontrolna certyfikatu atrybutu";
"06 08 2B 06 01 05 05 07 01 05"		= "Kierowanie certyfikatu atrybutu";
"06 08 2B 06 01 05 05 07 01 06"		= "Kontrola Urzędu certyfikacji atrybutu";
"06 08 2B 06 01 05 05 07 01 07"		= "Blok adresu IP SBGP";
"06 08 2B 06 01 05 05 07 01 08"		= "ID systemu autonomicznego SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "ID routera SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "Proxy certyfikatu atrybutu";
"06 08 2B 06 01 05 05 07 01 0B"		= "Dostęp podmiotu do informacji";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotyp";

"06 07 2B 06 01 05 05 07 02"		= "Typy kwalifikatorów zasad";
"06 08 2B 06 01 05 05 07 02 01"		= "Instrukcje procesu certyfikacji";
"06 08 2B 06 01 05 05 07 02 02"		= "User Notice";
"06 08 2B 06 01 05 05 07 02 03"		= "Notatka tekstowa";

"06 07 2B 06 01 05 05 07 03"		= "Cel klucza";
"06 08 2B 06 01 05 05 07 03 01"		= "Uwierzytelnianie serwera";
"06 08 2B 06 01 05 05 07 03 02"		= "Uwierzytelnienie klienta";
"06 08 2B 06 01 05 05 07 03 03"		= "Podpisywanie kodu";
"06 08 2B 06 01 05 05 07 03 04"		= "Ochrona email";
"06 08 2B 06 01 05 05 07 03 05"		= "System końcowy IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "Tunel IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "Użytkownik IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "Znakowanie czasem";
"06 08 2B 06 01 05 05 07 03 09"		= "Podpisywanie OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Uwierzytelnianie serwera SBGP AA";

"06 07 2B 06 01 05 05 07 04"		= "Typy informacji CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Certyfikat szyfrowania protokołu CA";
"06 08 2B 06 01 05 05 07 04 02"		= "Typy par kluczy podpisujących";
"06 08 2B 06 01 05 05 07 04 03"		= "Typy par kluczy szyfrujących";
"06 08 2B 06 01 05 05 07 04 04"		= "Preferowany algorytm symetryczny";
"06 08 2B 06 01 05 05 07 04 05"		= "Dane uaktualnienia klucza CA";
"06 08 2B 06 01 05 05 07 04 06"		= "Bieżący CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "Nieobsługiwane OID";
"06 08 2B 06 01 05 05 07 04 08"		= "Żądanie subskrypcji";
"06 08 2B 06 01 05 05 07 04 09"		= "Odpowiedź subskrypcji";
"06 08 2B 06 01 05 05 07 04 0A"		= "Żądanie parametru pary kluczy";
"06 08 2B 06 01 05 05 07 04 0B"		= "Odpowiedź parametru pary kluczy";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Rejestracja CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Kontrola rejestracji";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Token rejestracji";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Wartość uwierzytelniająca";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Informacje o publikacji PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Opcje archiwum PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Stary ID certyfikatu";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Klucz protokołu szyfrowania";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Szablon certyfikatu zamiennego";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Szablon WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "Dane rejestracji CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Pary UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Żądanie certyfikatu";

"06 07 2B 06 01 05 05 07 06"		= "Algorytmy";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Brak podpisu";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Kontrola CMC";

"06 07 2B 06 01 05 05 07 08"		= "Inne nazwy";
"06 08 2B 06 01 05 05 07 08 01"		= "Dane prywatne";
"06 08 2B 06 01 05 05 07 08 02"		= "Grupa użytkowników";

"06 07 2B 06 01 05 05 07 09"		= "Dane prywatne";
"06 08 2B 06 01 05 05 07 09 01"		= "Data urodzenia";
"06 08 2B 06 01 05 05 07 09 02"		= "Miejsce urodzenia";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudonim";
"06 08 2B 06 01 05 05 07 09 04"		= "Płeć";
"06 08 2B 06 01 05 05 07 09 05"		= "Kraj obywatelstwa";
"06 08 2B 06 01 05 05 07 09 06"		= "Kraj zamieszkania";

"06 07 2B 06 01 05 05 07 0A"		= "Certyfikat atrybutu";
"06 08 2B 06 01 05 05 07 0A 01"		= "Dane uwierzytelniania";
"06 08 2B 06 01 05 05 07 0A 02"		= "Jednostka dostępu";
"06 08 2B 06 01 05 05 07 0A 03"		= "Jednostka obciążająca";
"06 08 2B 06 01 05 05 07 0A 04"		= "Grupa";
"06 08 2B 06 01 05 05 07 0A 05"		= "Stanowisko";
"06 08 2B 06 01 05 05 07 0A 06"		= "SSID WLAN";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Protokół statusu certyfikatów sieciowych";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Podstawowa odpowiedź OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Rozszerzenie ID jednorazowego OCSP";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Odwołanie CLR OCSP";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Odpowiedź OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "Sprawdzenie braku unieważnienia OCSP";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Odcięcie archiwum OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Lokalizator usługi OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Wydawcy CA";
"06 08 2B 06 01 05 05 07 30 03"		= "Znakowanie czasem";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE Intermediate";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Algorytm szyfrowania DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Algorytm mieszający DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Algorytm podpisu DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 z RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 z RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 z RSA";
"06 05 2B 0E 03 02 03"				= "MD5 z RSA";
"06 05 2B 0E 03 02 04"				= "MD4, szyfr. RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N z RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Podpis RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA z SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 z podpisem RSA";
"06 05 2B 0E 03 02 0F"				= "SHA z podpisem RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman z Common Modulus";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA typowy";
"06 05 2B 0E 03 02 15"				= "DSA typowy z SHA";
"06 05 2B 0E 03 02 16"				= "Przekazanie klucza RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 z podpisem RSA";
"06 05 2B 0E 03 02 19"				= "MD5 z podpisem RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA z SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA z typowym SHA-1";
"06 05 2B 0E 03 02 1D"				= "SHA-1, szyfr. RSA";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 z RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 z ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Dokument";
"06 04 2B 24 01 01"					= "Wersja końcowa";
"06 04 2B 24 01 02"					= "Roboczy";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algorytm";
"06 04 2B 24 03 01"					= "Algorytm szyfrowania";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "Dopełnienie DES-ECB";
"06 07 2B 24 03 01 01 01 01"		= "Dopełnienie DES-ECB ISO";
"06 07 2B 24 03 01 01 02 01"		= "Dopełnienie DES-CBC";
"06 08 2B 24 03 01 01 02 01 01"		= "Dopełnienie DES-CBC ISO";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "Dopełnienie DES3-ECB";
"06 08 2B 24 03 01 03 01 01 01"		= "Dopełnienie DES3-ECB ISO";
"06 07 2B 24 03 01 03 02 01"		= "Dopełnienie DES3-CBC";
"06 08 2B 24 03 01 03 02 01 01"		= "Dopełnienie DES3-CBC ISO";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "Dopełnienie IDEA-ECB";
"06 08 2B 24 03 01 02 01 01 01"		= "Dopełnienie IDEA-ECB ISO";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "Dopełnienie IDEA-CBC";
"06 08 2B 24 03 01 02 02 01 01"		= "Dopełnienie IDEA-CBC ISO";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Szyfrowanie RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "Dopełnienie BSI-1-ECB";
"06 06 2B 24 03 01 05 02"			= "Dopełnienie BSI-1-CBC";
"06 07 2B 24 03 01 05 02 01"		= "Dopełnienie BSI-1-CBC PEM";

"06 04 2B 24 03 02"					= "Algorytm mieszający";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 (pojedyncza długość)";
"06 05 2B 24 03 02 05"				= "MDC2 (podwójna długość)";
"06 04 2B 24 03 03"					= "Algorytm podpisu";
"06 05 2B 24 03 03 01"				= "Podpis RSA";

"06 06 2B 24 03 03 01 01"			= "Podpis RSA z SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Podpis RSA z SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Podpis RSA z SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Podpis RSA z SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Podpis RSA z SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Podpis RSA z SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Podpis RSA z SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Podpis RSA z SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Podpis RSA z SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Podpis RSA z SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Podpis RSA z SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Podpis RSA z SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Podpis RSA z SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Podpis RSA z SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Podpis RSA z SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Podpis RSA z SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Podpis RSA z SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Podpis RSA z SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Podpis RSA z SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Podpis RSA z SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Podpis RSA z SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Podpis RSA z SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Podpis RSA z SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Podpis RSA z SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Podpis RSA z SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Podpis RSA z SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Podpis RSA z RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Podpis RSA z RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Podpis RSA z RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Podpis RSA z RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Podpis RSA z RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Podpis RSA z RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Podpis RSA z RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Podpis RSA z RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Podpis RSA z RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Podpis RSA z RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Podpis RSA z RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Podpis RSA z RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Podpis RSA z RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "RSA Signature with RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Podpis RSA z RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Podpis RSA z RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Podpis RSA z RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Podpis RSA z RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Podpis RSA z RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Podpis RSA z RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Podpis RSA z RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Podpis RSA z RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Podpis RSA z RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Podpis RSA z RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Podpis RSA z RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Podpis RSA z RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Podpis RSA z RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Podpis RSA z RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Podpis ECSIE";
"06 06 2B 24 03 03 02 01"			= "Podpis ECSIE z SHA-1";
"06 06 2B 24 03 03 02 02"			= "Podpis ECSIE z RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Podpis ECSIE z MD2";
"06 06 2B 24 03 03 02 04"			= "Podpis ECSIE z MD5";

"06 04 2B 24 03 04"					= "Schemat podpisu";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 z RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 z RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 z RND";

"06 03 2B 24 04"					= "Atrybut";
"06 03 2B 24 05"					= "Zasady";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "API specyficzne dla producenta";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "API specyficzne dla funkcji";
"06 03 2B 24 07"					= "Zarządzanie kluczem";
"06 04 2B 24 07 01"					= "Uzgadnianie klucza";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Przesłanie klucza";
"06 05 2B 24 07 02 01"				= "ISO9796-2, szyfr. RSA";

"06 05 2B 24 08 01 01"				= "ID zasad Teletrust SigiSigConform";
"06 05 2B 24 08 02 01"				= "Usługa katalogowa";

"06 05 2B 24 08 03 01"				= "Data wygenerowania certyfikatu";
"06 05 2B 24 08 03 02"				= "Pełnomocnictwo";
"06 05 2B 24 08 03 03"				= "Przyjęcie";
"06 05 2B 24 08 03 04"				= "Limit monetarny";
"06 05 2B 24 08 03 05"				= "Deklaracja większości";
"06 05 2B 24 08 03 06"				= "Numer seryjny karty obwodu zintegrowanego";
"06 05 2B 24 08 03 07"				= "Odniesienie klucza publicznego";
"06 05 2B 24 08 03 08"				= "Ograniczenie";
"06 05 2B 24 08 03 09"				= "Odzyskaj, gdy dozwolone";
"06 05 2B 24 08 03 0A"				= "Żądany certyfikat";
"06 05 2B 24 08 03 0B"				= "Urzędy nazewnictwa";
"06 05 2B 24 08 03 0C"				= "Certyfikat w katalogu od";
"06 05 2B 24 08 03 0D"				= "Skrót certyfikatu";

"06 05 2B 24 08 04 01"				= "Dane prywatne";
"06 05 2B 24 08 04 08"				= "Ograniczenie";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indicate SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA Indicate RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA z SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA z RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA Rozszerzone";
"06 07 2B 24 08 05 01 02 02"		= "DSA z RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Certyfikat";
"06 05 2B 24 08 06 02"				= "Odniesienie certyfikatu";
"06 05 2B 24 08 06 03"				= "Certyfikat atrybutu";
"06 05 2B 24 08 06 04"				= "Odniesienie atrybutu";
"06 05 2B 24 08 06 05"				= "Nazwa pliku";
"06 05 2B 24 08 06 06"				= "Czas przechowania";
"06 05 2B 24 08 06 07"				= "Wielkość pliku";
"06 05 2B 24 08 06 08"				= "Lokalizacja";
"06 05 2B 24 08 06 09"				= "Numer podpisu";
"06 05 2B 24 08 06 0A"				= "Wygenerowany automatycznie";

"06 05 2B 24 08 07 01"				= "Typy prezentacji Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binarny";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Rysuj";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= " RTF ";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Tekst";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Rozszerzenia certyfikatu Thawte";
"06 05 2B 65 01 04 01"				= "Silny Extranet";

/* X.520 */

"06 02 55 04"		= "Typy atrybutów X.520";
"06 03 55 04 00"	= "Klasa obiektu";
"06 03 55 04 01"	= "Nazwa początkowa aliasu";
"06 03 55 04 02"	= "Dane wiedzy";
"06 03 55 04 03"	= "Nazwa publiczna";
"06 03 55 04 04"	= "Nazwisko";
"06 03 55 04 05"	= "Numer seryjny";
"06 03 55 04 06"	= "Kraj";
"06 03 55 04 07"	= "Miejscowość";
"06 04 55 04 07 01"	= "Zbiorcza nazwa miasta";
"06 03 55 04 08"	= "Jedn. administr.";
"06 04 55 04 08 01"	= "Zbiorcza jedn. administr.";
"06 03 55 04 09"	= "Ulica";
"06 04 55 04 09 01"	= "Zbiorcza nazwa ulicy";
"06 03 55 04 0A"	= "Organizacja";
"06 04 55 04 0A 01"	= "Zbiorcza nazwa organizacji";
"06 03 55 04 0B"	= "Jedn. organizacyjna";
"06 04 55 04 0B 01"	= "Zbiorcza nazwa jednostki organizacyjnej";
"06 03 55 04 0C"	= "Tytuł";
"06 03 55 04 0D"	= "Opis";
"06 03 55 04 0E"	= "Przewodnik wyszukiwania";
"06 03 55 04 0F"	= "Kategoria firmy";
"06 03 55 04 10"	= "Adres pocztowy";
"06 04 55 04 10 01"	= "Zbiorczy adres pocztowy";
"06 03 55 04 11"	= "Kod pocztowy";
"06 04 55 04 11 01"	= "Zbiorczy kod pocztowy";
"06 03 55 04 12"	= "Skrzynka pocztowa";
"06 04 55 04 12 01"	= "Zbiorcza skrzynka pocztowa";
"06 03 55 04 13"	= "Nazwa fizycznego biura doręczenia";
"06 04 55 04 13 01"	= "Zbiorcza nazwa fizycznego biura doręczenia";
"06 03 55 04 14"	= "Numer telefonu";
"06 04 55 04 14 01"	= "Zbiorczy numer telefonu";
"06 03 55 04 15"	= "Numer teleksu";
"06 04 55 04 15 01"	= "Zbiorczy numer teleksu";
"06 03 55 04 16"	= "ID terminalu teletekstowego";
"06 04 55 04 16 01"	= "Zbiorczy ID terminala teletekstowego";
"06 03 55 04 17"	= "Numer telefonu faksu";
"06 04 55 04 17 01"	= "Zbiorczy numer telefonu faksu";
"06 03 55 04 18"	= "Adres X.121";
"06 03 55 04 19"	= "Międzynarodowy numer ISDN";
"06 04 55 04 19 01"	= "Zbiorczy międzynarodowy numer ISDN";
"06 03 55 04 1A"	= "Zarejestrowany adres";
"06 03 55 04 1B"	= "Wskaźnik przeznaczenia";
"06 03 55 04 1C"	= "Preferowana metoda doręczenia";
"06 03 55 04 1D"	= "Adres prezentacji";
"06 03 55 04 1E"	= "Kontekst obsługi programu";
"06 03 55 04 1F"	= "Uczestnik";
"06 03 55 04 20"	= "Właściciel";
"06 03 55 04 21"	= "Funkcja użytkownika";
"06 03 55 04 22"	= "Zobacz także";
"06 03 55 04 23"	= "Hasło użytkownika";
"06 03 55 04 24"	= "Certyfikat użytkownika";
"06 03 55 04 25"	= "Certyfikat CA";
"06 03 55 04 26"	= "Lista unieważnień urzędów";
"06 03 55 04 27"	= "Lista unieważnień certyfikatów";
"06 03 55 04 28"	= "Para certyfikatów wzajemnych";
"06 03 55 04 29"	= "Nazwa";
"06 03 55 04 2A"	= "Imię";
"06 03 55 04 2B"	= "Inicjały";
"06 03 55 04 2C"	= "Kwalifikator generacji";
"06 03 55 04 2D"	= "Unikalny ID";
"06 03 55 04 2E"	= "Kwalifikator DN";
"06 03 55 04 2F"	= "Rozszerzony przewodnik wyszukiwania";
"06 03 55 04 30"	= "Informacje o protokole";
"06 03 55 04 31"	= "Unikalna nazwa";
"06 03 55 04 32"	= "Unikalny uczestnik";
"06 03 55 04 33"	= "ID budynku";
"06 03 55 04 34"	= "Obsługiwane algorytmy";
"06 03 55 04 35"	= "Lista przyrostów unieważnień";
"06 03 55 04 36"	= "Autoryzacja";
"06 03 55 04 3A"	= "Para certyfikatów wzajemnych";

/* X.500 object classes */

"06 02 55 06"		= "Klasa obiektu X.520";
"06 03 55 06 00"	= "Na górze";
"06 03 55 06 01"	= "Skrót";
"06 03 55 06 02"	= "Kraj";
"06 03 55 06 03"	= "Miasto";
"06 03 55 06 04"	= "Organizacja";
"06 03 55 06 05"	= "Jednostka organizacyjna";
"06 03 55 06 06"	= "Osoba";
"06 03 55 06 07"	= "Osoba reprezentująca organizację";
"06 03 55 06 08"	= "Funkcja organizacyjna";
"06 03 55 06 09"	= "Grupa nazw";
"06 03 55 06 0A"	= "Osoba zamieszkała";
"06 03 55 06 0B"	= "Proces programu";
"06 03 55 06 0C"	= "Jednostka programu";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Urządzenie";
"06 03 55 06 0F"	= "Silne uwierzytelnienie użytkownika";
"06 03 55 06 10"	= "Urząd certyfikacji";
"06 03 55 06 11"	= "Grupa unikalnych nazw";
"06 03 55 06 15"	= "Użytkownik PKI";
"06 03 55 06 16"	= "CA PKI";

/* X.500 algorithms */

"06 02 55 08"		= "Algorytmy X.500";
"06 03 55 08 01"	= "Algorytmy szyfrujące X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Rozszerzenia certyfikatu X.509";
"06 03 55 1D 01"	= "ID klucza urzędu (stary)";
"06 03 55 1D 02"	= "Atrybuty klucza głównego (stare)";
"06 03 55 1D 03"	= "Zasady certyfikatów (stare)";
"06 03 55 1D 04"	= "Ograniczenie użycia klucza (stare)";
"06 03 55 1D 05"	= "Odwzorowania zasad (stare)";
"06 03 55 1D 06"	= "Ograniczenie poddrzew";
"06 03 55 1D 07"	= "Alternatywna nazwa podmiotu (stara)";
"06 03 55 1D 08"	= "Alternatywna nazwa wystawcy (stara)";
"06 03 55 1D 09"	= "Atrybuty katalogu podmiotów";
"06 03 55 1D 0A"	= "Ograniczenia podstawowe (stare 2.5.29.10)";
"06 03 55 1D 0B"	= "Ograniczenia nazwy (stare)";
"06 03 55 1D 0C"	= "Ograniczenia zasad (stare)";
"06 03 55 1D 0D"	= "Ograniczenia podstawowe (stare 2.5.29.13)";
"06 03 55 1D 0E"	= "ID klucza podmiotu";
"06 03 55 1D 0F"	= "Użycie klucza";
"06 03 55 1D 10"	= "Okres użycia klucza prywatnego";
"06 03 55 1D 11"	= "Alternatywna nazwa podmiotu";
"06 03 55 1D 12"	= "Alternatywna nazwa wystawcy";
"06 03 55 1D 13"	= "Ograniczenia podstawowe";
"06 03 55 1D 14"	= "Numer listy unieważnień certyfikatów";
"06 03 55 1D 15"	= "Kod przyczyny CRL";
"06 03 55 1D 16"	= "Data wygaśnięcia (stara)";
"06 03 55 1D 17"	= "Kod instrukcji wstrzymania";
"06 03 55 1D 18"	= "Data nieważności";
"06 03 55 1D 19"	= "Punkty dystrybucyjne CRL (stare)";
"06 03 55 1D 1A"	= "Punkt dystrybucyjny wystawcy (stary)";
"06 03 55 1D 1B"	= "Wskaźnik przyrostu CRL";
"06 03 55 1D 1C"	= "Punkt dystrybucyjny wystawcy";
"06 03 55 1D 1D"	= "Wystawca certyfikatu";
"06 03 55 1D 1E"	= "Ograniczenia nazwy";
"06 03 55 1D 1F"	= "Punkty dystrybucyjne CRL";
"06 03 55 1D 20"	= "Zasady certyfikatów";
"06 04 55 1D 20 00"	= "Dowolny ID zasad";
"06 03 55 1D 21"	= "Odwzorowania zasad";
"06 03 55 1D 22"	= "Ograniczenia zasad";
"06 03 55 1D 23"	= "ID klucza urzędu";
"06 03 55 1D 24"	= "Ograniczenia zasad";
"06 03 55 1D 25"	= "Rozszerzone użycie klucza";
"06 04 55 1D 25 00"	= "Dowolne rozszerzone użycie klucza";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Algorytm podpisu SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "Algorytm podpisu Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Algorytm poufności SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Algorytm poufności Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Algorytm spójności SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Algorytm integralności Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Algorytm ochrony za pomocą tokenów SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "Algorytm ochrony za pomocą tokenów Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "Algorytm zarządzania kluczem SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Algorytm zarządzania kluczem Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Algorytm podpisu i zarządzania kluczem SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Algorytm zarządzania kluczem i podpisu Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Algorytm podpisu Suite A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Algorytm poufności Suite A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Algorytm integralności Suite A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Algorytm ochrony za pomocą tokenów Suite A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Algorytm zarządzania kluczem Suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Algorytm zarządzania kluczem i podpisu Suite A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Zaktualizowany algorytm podpisu Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "Algorytm zarządzania kluczem i zaktualizowany algorytm podpisu Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Zaktualizowany algorytm integralności Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Algorytm wymiany kluczy";
"06 09 60 86 48 01 65 02 01 01 17"	= "Algorytm Wrap80 Fortezza";
"06 09 60 86 48 01 65 02 01 01 18"	= "Algorytm szyfrowania kluczy (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Format wiadomości RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "Pusta zawartość";
"06 09 60 86 48 01 65 02 01 02 03"	= "Typ zawartości CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Typ zawartości MSP, poprawka 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Typ zawartości MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Protokół agenta zmiany certyfikatu MSP";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Typ zawartości MSP, poprawka 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Treść wiadomości MSP przekazanej dalej";
"06 09 60 86 48 01 65 02 01 02 49"	= "Parametry wiadomości przekazana dalej MSP";
"06 09 60 86 48 01 65 02 01 02 50"	= "Treść wiadomości CSP przekazanej dalej";
"06 09 60 86 48 01 65 02 01 02 51"	= "Parametry wiadomości przekazanej dalej CSP";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Zasady bezpieczeństwa SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "PRBAC SDNS";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Zasada ochrony";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Uniwersalne";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Domyślne zasady ochrony";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Certyfikat zarządzania kluczem SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Certyfikat podpisu użytkownika SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "Certyfikat zarządzania kluczem i podpisu SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Certyfikat zarządzania kluczem Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Certyfikat zarządzania kluczem i podpisu Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Certyfikat podpisu użytkownika Fortezza";
"06 09 60 86 48 01 65 02 01 05 07"	= "Certyfikat podpisu CA Fortezza";
"06 09 60 86 48 01 65 02 01 05 08"	= "Certyfikat podpisu CA SDNS";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Wektor pomocniczy";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Zasady odbioru";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Przynależność";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Administratorzy";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "CKL SDNS";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS Signature CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "CKL podpisu SDNS";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Lista unieważnień certyfikatów SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Lista unieważnień certyfikatów Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "CKL Fortezza";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Zwolniony procesor adresów";
"06 09 60 86 48 01 65 02 01 05 30"	= "Guard";
"06 09 60 86 48 01 65 02 01 05 31"	= "Obsługiwane algorytmy";
"06 09 60 86 48 01 65 02 01 05 32"	= "Certyfikat zarządzania kluczem Suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Certyfikat zarządzania kluczem i podpisu Suite A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Certyfikat podpisu użytkownika Suite A";
"06 09 60 86 48 01 65 02 01 05 35"	= "Informacje PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "Ograniczenia CA PRBAC";
"06 09 60 86 48 01 65 02 01 05 37"	= "Uprawnienia do podpisu lub zarządzania kluczami";
"06 09 60 86 48 01 65 02 01 05 38"	= "Przywileje Comm";
"06 09 60 86 48 01 65 02 01 05 39"	= "Atrybut z etykietą";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Plik informacji o zasadach";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Plik informacji o zasadach ochrony";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Ograniczenia autoryzacji CA";

"06 09 60 86 48 01 65 02 01 07 01"		= "Rozszerzenia CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Kategorie bezpieczeństwa ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Uprawnienia standardowej etykiety zabezpieczeń";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Uprawnienia do podpisu";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Uprawnienia do zarządzania kluczami";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Uprawnienie do nazwanego zestawu znaczników";
"06 09 60 86 48 01 65 02 01 0B 01"			= "Demo UK";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Departament Obrony USA - klasa 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Departament Obrony USA - klasa 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Departament Obrony USA - klasa 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Departament Obrony USA - klasa 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "Departament Obrony USA - PKI, klasa 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Testowe zasady ochrony";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 - zestaw znaczników 0";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 - zestaw znaczników 1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 - zestaw znaczników 2";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "Kategorie bezpieczeństwa TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 - zestaw znaczników 0";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 - zestaw znaczników 1";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 - zestaw znaczników 2";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kategorie bezpieczeństwa Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Nazwa zestawu znaczników 1 Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Nazwa zestawu znaczników 2 Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Nazwa zestawu znaczników 3 Kafka";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Wpis testowej listy CRL";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Etykieta";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "ID zasad GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "ID zasad FBCA Rudimentary";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "ID zasad FBCA Basic";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "ID zasad FBCA Medium";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "ID zasad FBCA High";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Klucz KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Rozszerzenia";
"06 09 60 86 48 01 65 03 02 03 01"		= "Technika odzyskiwania klucza";
"06 09 60 86 48 01 65 03 02 03 02"		= "Możliwość odzyskiwania klucza";
"06 09 60 86 48 01 65 03 02 03 03"		= "Odzyskiwanie klucza";
"06 08 60 86 48 01 65 03 02 04"			= "Schematy odzyskiwania klucza";
"06 08 60 86 48 01 65 03 02 05"			= "Rozszerzenie CSOR GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Algorytm NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Algorytm Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "Dopełnienie DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "Dopełnienie DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "Dopełnienie DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "Dopełnienie RC5-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2, szyfr. RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5, szyfr. RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1, szyfr. RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "Streszczenie LM";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC z SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC z MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "Dopełnienie RC2-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Pakiet MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "Szyfrowanie RSA BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Hasło NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Typ atrybutów PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Atrybuty ochrony";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Ograniczenie zaufania";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "ID obiektu Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Rozszerzenie certyfikatu Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Typ certyfikatu Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Podstawowy URL Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL unieważnienia Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL unieważnienia CA Netscape";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL pobierania listy CRL Netscape";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL pobierania certyfikatu CA Netscape";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL odnowienia certyfikatu Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL zasad CA Netscape";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL strony głównej certyfikatu Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Logo jednostki certyfikatu Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Obraz użytkownika certyfikatu Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Nazwa serwera SSL Netscape";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Komentarz do certyfikatu Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "Typ danych Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "image/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "image/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "tekst/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Sekwencja certyfikatu Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL certyfikatu Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "ID obiektu katalogu Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Definicje LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Dowód rejestracyjny";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Numer oddziału";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Numer pracownika";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Typ pracownika";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Osoba reprezentująca organizację (intranet)";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Szyfrowanie SGC";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Nieznane rozszerzenie Verisign VPN";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Nieznane rozszerzenie Verisign VPN";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "ID zasad Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Uwaga Verisign CPS v1";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "CA SGC Verisign";

/* SET */

"06 03 67 2A 00"	= "Typ zawartości";
"06 04 67 2A 00 00"	= "Dane PAN";
"06 04 67 2A 00 01"	= "Token PAN";
"06 04 67 2A 00 02"	= "Tylko PAN";

"06 03 67 2A 01"	= "Rozszerzenie komunikatu";
"06 03 67 2A 02"	= "Pole";
"06 04 67 2A 02 00"	= "Pełna nazwa";
"06 04 67 2A 02 01"	= "Imię";
"06 04 67 2A 02 02"	= "Nazwisko";
"06 04 67 2A 02 03"	= "Nazwisko rodowe";
"06 04 67 2A 02 04"	= "Nazwa miejsca";
"06 04 67 2A 02 05"	= "Numer identyfikacji";
"06 04 67 2A 02 06"	= "Miesiąc";
"06 04 67 2A 02 07"	= "Data";
"06 04 67 2A 02 08"	= "Adres";
"06 04 67 2A 02 09"	= "Telefon";
"06 04 67 2A 02 0A"	= "Kwota";
"06 04 67 2A 02 0B"	= "Numer konta";
"06 04 67 2A 02 0C"	= "Hasło";

"06 03 67 2A 03"		= "Atrybut";
"06 04 67 2A 03 00"		= "Certyfikat";
"06 05 67 2A 03 00 00"	= "Odcisk palca klucza głównego";
"06 05 67 2A 03 00 01"	= "Zasady dodatkowe";

"06 03 67 2A 04"	= "Algorytm";
"06 03 67 2A 05"	= "Zasady";
"06 04 67 2A 05 00"	= "Główny";
"06 03 67 2A 06"	= "Moduł";
"06 03 67 2A 07"	= "Rozszerzenie certyfikatu";
"06 04 67 2A 07 00"	= "Zaszyfrowany klucz główny";
"06 04 67 2A 07 01"	= "Typ certyfikatu";
"06 04 67 2A 07 02"	= "Dane handlowe";
"06 04 67 2A 07 03"	= "Wymagany certyfikat karty";
"06 04 67 2A 07 04"	= "Tunelowanie";
"06 04 67 2A 07 05"	= "Rozszerzenia SET";
"06 04 67 2A 07 06"	= "Kwalifikator SET";

"06 03 67 2A 08"	= "Marka";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Producent";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Leksem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Narodowy";
"06 05 67 2A 0A E2 00"	= "Japonia";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Zaszyfrowany klucz główny";
"06 04 86 8D 6F 03"	= "Typ certyfikatu";
"06 04 86 8D 6F 04"	= "Dane handlowe";
"06 04 86 8D 6F 05"	= "Wymagany certyfikat karty";
"06 04 86 8D 6F 06"	= "Tunelowanie";
"06 04 86 8D 6F 07"	= "Kwalifikator SET";
"06 04 86 8D 6F 63"	= "Dane SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Ochrona danych Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "ID zasad zaufania Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Zasady Apple iSign";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Zasady podstawowe Apple X.509";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Zasady SSL Apple";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Zasady generowania certyfikatu lokalnego Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Zasady generowania CSR lokalnego Apple";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Zasady unieważniania CRL Apple";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Zasady unieważniania OCSP Apple";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Zasady S/MIME Apple";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Zasady rozszerzonego uwierzytelnienia w Apple";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Zasady podpisywania uaktualnień programów Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Zasady Apple IPsec";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Zasady Apple iChat";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Zasady podpisywania zasobów Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Zasady Apple klienta Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Zasady Apple serwera Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Zasady podpisywania kodu Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Zasady podpisywania pakietów Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "ID algorytmu ochrony Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Szybkie szyfrowanie eliptyczne (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Bezpieczna kompresja Apple (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE z podpisem MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE z podpisem SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Szyfrowanie Apple FEED";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (eksperymentalny)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE z podpisem ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "ID certyfikatu Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Żądanie certyfikatu Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Żądanie certyfikatu tożsamości Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Żądanie certyfikatu podpisywania email Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Żądanie certyfikatu szyfrowania email Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Żądanie wykazu archiwum Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Żądanie zachowania archiwum Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Żądanie pobrania archiwum Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Żądanie usunięcia archiwum Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Rozszerzenie certyfikatu Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Tożsamość Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Podpisywanie email Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Szyfrowanie email Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Wartość żądania certyfikatu Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Użytkownik";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Hasło";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Nazwa hosta";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Sygnalizator odnowienia";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Flaga Asynchroniczne";

"06 08 2A 86 48 86 F7 63 64 04" = "Rozszerzone użycie klucza Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Podpisywanie kodu Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Podpisywanie kodu Apple (programowanie)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Podpisywanie uaktualnień programów Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Podpisywanie kodu Apple (zastrzeżone)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Podpisywanie zasobów Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Podpisywanie Apple iChat";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Szyfrowanie Apple iChat";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Tożsamość systemu Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "Zasady certyfikatów Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Zasada certyfikatów Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Zasady certyfikatów Apple .Mac";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Podpisywanie kodu";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Zabezpieczenia Intel CDSA";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Formaty zabezpieczeń Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Rozszerzenia certyfikatu X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Rozszerzenia certyfikatu prywatnego X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Obrazek bitmapowy podpisu podmiotu";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Obrazek podmiotu";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Adres email podmiotu";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Użyj wykluczeń";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Algorytmy zabezpieczeń Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 z ECDSA";

/* end */
